src/Catalogs/НастройкиРасчетаСебестоимости/НастройкиРасчетаСебестоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиРасчетаСебестоимости</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтраженияВУчете</name>
    <type>
      <types>EnumRef.ВидыОтраженияВУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьДокументыАвтоматически</name>
    <comment>Формировать документы автоматически (регламентным заданием)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <comment>Уникальный идентификатор регламентного задания</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Задержка</name>
    <comment>Количество месяцев, на которое дата проводимого документа меньше текущей даты</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполняемыеДействия</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ВыполняемоеДействие</name>
      <comment>(Общ)</comment>
      <type>
        <types>EnumRef.ВыполняемыеОперацииРасчетСебестоимостиВыпуска</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ВидыОтраженияВУчете/ВидыОтраженияВУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОтраженияВУчете</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ОтражатьВУправленческомУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьВБухгалтерскомУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьВМеждународномУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьВНалоговомУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьВРегламентированномУчете</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/НастройкиРасчетаСебестоимости/Forms/ФормаЭлементаУправляемая/Module.bsl
&НаКлиенте
Перем НужноУдалитьРегламентноеЗадание Экспорт; // Ответ пользователя на вопрос о необходимости удалять регл. задание (булево или неопределено)
&НаКлиенте
Перем РазрешеноРедактированиеДатыНачала; //Булево - спрашивали ли в сеансе работы с формой о разрешении редактирования даты начала обработки данных

// Устанавливает подпись к полю Задержка с учетом формы множественного числа
&НаКлиенте
Процедура НастроитьНадписьЗадержка()
	
	Если РасчитыватьСебестоимостьЗаПредыдущийПериод Тогда
	
		Элементы.НадписьПояснениеЗадержка.Заголовок = "";
		
	Иначе
		
		Элементы.НадписьПояснениеЗадержка.Заголовок = "Расчет будет проводиться за текущий месяц";
		
	КонецЕсли;
	
	Дней = ОбщегоНазначения.ФормаМножественногоЧисла("месяц","месяца","месяцев", Объект.Задержка);
	
	Элементы.Задержка.Заголовок = Дней + " назад";
	
КонецПроцедуры

// Устанавливает доступность элементов формы
//

&НаКлиенте
Процедура УправлениеДоступностью()
	
	Если ТолькоПросмотр Тогда
		// Доступность регулируется настройками в диалоге
		Возврат;
	КонецЕсли;
	
	Элементы.ПредставлениеРасписания.Доступность = Объект.ФормироватьДокументыАвтоматически;
	Элементы.РасчитыватьСебестоимостьЗаПредыдущийПериод.Доступность = Объект.ФормироватьДокументыАвтоматически;
	Элементы.Задержка.Доступность = Объект.ФормироватьДокументыАвтоматически И РасчитыватьСебестоимостьЗаПредыдущийПериод;
	Элементы.Организация.Доступность = (Объект.ВидОтраженияВУчете <> ВидОтраженияВУчетеОтражатьВУправленческомУчете);
	
	Элементы.СтраницаРасписание.Заголовок = Нстр("ru = 'Расписание '") + ?(Расписание = Неопределено, Нстр("ru = '(не задано)'"),"");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыполняемыеДействия()

	Если Объект.ВидОтраженияВУчете = Перечисления.ВидыОтраженияВУчете.ОтражатьВУправленческомУчете ТОгда
		ОтражатьВУправленческомУчете = Истина;
		ОтражатьВБухгалтерскомУчете = Ложь;
	Иначе
		ОтражатьВУправленческомУчете = Ложь;
		ОтражатьВБухгалтерскомУчете = Истина;
	КонецЕсли;	
	
	МассивДействий = ПроцедурыРасчетаСебестоимостиВыпуска.ПолучитьМассивВыполняемыхДействий(ТекущаяДата(), Объект.Организация, ОтражатьВУправленческомУчете, ОтражатьВБухгалтерскомУчете, Истина);
	
	Объект.ВыполняемыеДействия.Очистить();
	Для Каждого ТекущееДействие Из МассивДействий Цикл
		НоваяСтрока = Объект.ВыполняемыеДействия.Добавить();
		НоваяСтрока.ВыполняемоеДействие = ТекущееДействие;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеДоступностью();
	Элементы.ПредставлениеРасписания.Заголовок = ПредставлениеРасписания;
	НастроитьНадписьЗадержка();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидОтраженияВУчетеОтражатьВУправленческомУчете = Перечисления.ВидыОтраженияВУчете.ОтражатьВУправленческомУчете;
	Расписание = РегламентныеПроцедуры.ПолучитьРасписаниеРегламентногоЗадания(Объект.РегламентноеЗадание);
	РасчитыватьСебестоимостьЗаПредыдущийПериод = (Объект.Задержка <> 0);
	РегламентныеПроцедуры.НастроитьПредставлениеРасписания(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьДокументыАвтоматическиПриИзменении(Элемент)
	ФормироватьДокументыАвтоматически = Объект.ФормироватьДокументыАвтоматически;
	НужноУдалитьРегламентноеЗадание = РегламентныеПроцедуры.ПриИзмененииФлагаФормироватьДокументыАвтоматически(ЭтаФорма);
	УправлениеДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеРасписанияНажатие(Элемент)
	РегламентныеПроцедуры.РедактироватьРасписаниеРегламентногоЗадания(ЭтаФорма);
	Элементы.ПредставлениеРасписания.Заголовок = ПредставлениеРасписания;
	УправлениеДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПараметрыЗаписи.Вставить("НужноУдалитьРегламентноеЗадание", НужноУдалитьРегламентноеЗадание);
	ПараметрыЗаписи.Вставить("Расписание", Расписание);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.НужноУдалитьРегламентноеЗадание = Истина Тогда
		ЗаголовокСообщения = ТекущийОбъект.ЗаголовокПриЗаписи();
		РегламентныеПроцедуры.УдалитьРегламентноеЗаданиеПриЗаписиНастройки(ТекущийОбъект,ЗаголовокСообщения,Отказ);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Обрабатываем расписание регл. задания
	Если НЕ ТекущийОбъект.ФормироватьДокументыАвтоматически Тогда 
		Возврат;
	КонецЕсли;
	
	ЗаголовокСообщения = ТекущийОбъект.ЗаголовокПриЗаписи();
	РегламентныеПроцедуры.ИзменитьРегламентноеЗаданиеПриЗаписиНастройки(ТекущийОбъект,ПараметрыЗаписи.Расписание,ЗаголовокСообщения,Отказ);

КонецПроцедуры

&НаКлиенте
Процедура РасчитыватьСебестоимостьЗаПредыдущийПериодПриИзменении(Элемент)
	Если НЕ РасчитыватьСебестоимостьЗаПредыдущийПериод Тогда
		Объект.Задержка = 0;
	Иначе
		Объект.Задержка = 1;
	КонецЕсли;
	
	УправлениеДоступностью();
	НастроитьНадписьЗадержка();
КонецПроцедуры

&НаКлиенте
Процедура ЗадержкаПриИзменении(Элемент)
	НастроитьНадписьЗадержка();
КонецПроцедуры

&НаКлиенте
Процедура ВыполняемыеДействияВыполняемоеДействиеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	Элемент.СписокВыбора.ЗагрузитьЗначения(ПроцедурыРасчетаСебестоимостиВыпуска.ПолучитьМассивВыполняемыхДействий(ТекущаяДата(), Объект.Организация, (Объект.ВидОтраженияВУчете = ВидОтраженияВУчетеОтражатьВУправленческомУчете), (Объект.ВидОтраженияВУчете <> ВидОтраженияВУчетеОтражатьВУправленческомУчете)));	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыполняемыхДействий(Команда)
	Если Объект.ВыполняемыеДействия.Количество() > 0 Тогда
	 
		Ответ = Вопрос("В документе уже присутствуют строки." + Символы.ПС
					 + "При заполнении они будут удалены!" + Символы.ПС
					 + "Продолжить?", РежимДиалогаВопрос.ДаНет,,
					 КодВозвратаДиалога.Нет,
					 "Заполнить список действий");
					 
		Если Не Ответ = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
		Объект.ВыполняемыеДействия.Очистить();
	КонецЕсли;
	
	ЗаполнитьВыполняемыеДействия();
КонецПроцедуры

&НаКлиенте
Процедура ВидОтраженияВУчетеПриИзменении(Элемент)
	Если Объект.ВидОтраженияВУчете = ВидОтраженияВУчетеОтражатьВУправленческомУчете Тогда
		Организация = "";
	КонецЕсли;
	УправлениеДоступностью();
КонецПроцедуры
